# -*- coding: utf-8 -*-
"""
Задание 6.2

Запросить у пользователя ввод IP-адреса в формате 10.0.1.1
В зависимости от типа адреса (описаны ниже), вывести на стандартный поток вывода:
   'unicast' - если первый байт в диапазоне 1-223
   'multicast' - если первый байт в диапазоне 224-239
   'local broadcast' - если IP-адрес равен 255.255.255.255
   'unassigned' - если IP-адрес равен 0.0.0.0
   'unused' - во всех остальных случаях

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
network_address = input("Введите IP-адрес")
1octet = int(network_address.split(".")[0])
if network_address == "255.255.255.255":
print("local broadcast")
elif network_address == "0.0.0.0":
print("unassigned")
elif 1 <= 1octet <== 233:
print("unicast")
elif 224 <= 1octet <== 239:
print("multicast")
else:
print("unused")
